#include <stdio.h>
#include "print_menu.h"

void programm_menu()
{
    printf("%s",
         "\n==========================Меню==========================\n"
           "|| 1. Ввести стек, реализованного массивом.           ||\n"
           "|| 2. Добавить элемент в стек.                        ||\n"
           "|| 3. Удалить элемент из стека.                       ||\n"
           "|| 4. Вывести стек                                    ||\n"
           "|| 5. Ввести стек, реализованного связанным списком.  ||\n"
           "|| 6. Добавить элемент в стек.                        ||\n"
           "|| 7. Удалить элемент из стека.                       ||\n"
           "|| 8. Вывести стек.                                   ||\n"
           "|| 9. Вывод адресса удаленных элементов               ||\n"
           "|| 10. Арифметическое выражение                       ||\n"
           "|| 11. Вывод замеров и эффективности                  ||\n"
           "|| 0. Выход                                           ||\n"
           "========================================================\n");
}
